Revit 2027 API
ScheduleSortGroupField.FieldId Property
 The ID of the field that the schedule will be sorted or grouped by.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFieldId FieldId { get; set; }
Public Property FieldId As ScheduleFieldId
	Get
	Set
public:
property ScheduleFieldId^ FieldId {
	ScheduleFieldId^ get ();
	void set (ScheduleFieldId^ value);
}
member FieldId : ScheduleFieldId with get, set
Property Value
ScheduleFieldId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace